; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v1 - type_1 ?v6 - type_3)
 	      (pred_1 ?v5 - object ?v6 - type_3)
	      (pred_4 ?v1 - type_1 ?v4 - type_2)
	      (pred_3 ?v1 - type_1 ?v5 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v1 - type_1 ?v2 ?v3 - type_3)
       :precondition (and  (pred_2 ?v1 ?v2))
       :effect (and  (pred_2 ?v1 ?v3)
		     (not (pred_2 ?v1 ?v2))))

   (:action op_1
       :parameters (?v1 - type_1 ?v7 - object ?v8 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v8) (pred_2 ?v1 ?v8) (pred_4 ?v1 ?v4))
       :effect (and (pred_3 ?v1 ?v7 ?v4)
		    (not (pred_1 ?v7 ?v8)) 
		    (not (pred_4 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_1 ?v7 - object ?v8 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v7 ?v4) (pred_2 ?v1 ?v8))
       :effect (and (pred_1 ?v7 ?v8)
		    (pred_4 ?v1 ?v4)
		    (not (pred_3 ?v1 ?v7 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_14 - type_1
obj_03 obj_08 obj_12 obj_07 - type_2
obj_01 obj_05 obj_02 obj_09 - type_3
obj_13 obj_11 obj_04 obj_06 - object)
(:init
(pred_2 obj_10 obj_02)
(pred_4 obj_10 obj_03)
(pred_4 obj_10 obj_08)
(pred_2 obj_14 obj_01)
(pred_4 obj_14 obj_12)
(pred_4 obj_14 obj_07)
(pred_1 obj_13 obj_09)
(pred_1 obj_11 obj_01)
(pred_1 obj_04 obj_09)
(pred_1 obj_06 obj_05)
)
(:goal
(and
(pred_1 obj_13 obj_09)
(pred_1 obj_11 obj_09)
(pred_1 obj_04 obj_09)
(pred_1 obj_06 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_10 obj_09) (pred_2 obj_14 obj_09))))
  )
)
)

; plan
1. (op_3 obj_10 obj_02 obj_01)
   deleted: (pred_2 obj_10 obj_02)
   added: (pred_2 obj_10 obj_01)
   goals met: 2 of 4
2. (op_1 obj_14 obj_11 obj_01 obj_07)
   deleted: (pred_1 obj_11 obj_01) (pred_4 obj_14 obj_07)
   added: (pred_3 obj_14 obj_11 obj_07)
   goals met: 2 of 4
3. (op_3 obj_14 obj_01 obj_05)
   deleted: (pred_2 obj_14 obj_01)
   added: (pred_2 obj_14 obj_05)
   goals met: 2 of 4
4. (op_1 obj_14 obj_06 obj_05 obj_12)
   deleted: (pred_1 obj_06 obj_05) (pred_4 obj_14 obj_12)
   added: (pred_3 obj_14 obj_06 obj_12)
   goals met: 2 of 4
5. (op_3 obj_14 obj_05 obj_09)
   deleted: (pred_2 obj_14 obj_05)
   added: (pred_2 obj_14 obj_09)
   goals met: 2 of 4
6. (op_2 obj_14 obj_06 obj_09 obj_12)
   deleted: (pred_3 obj_14 obj_06 obj_12)
   added: (pred_1 obj_06 obj_09) (pred_4 obj_14 obj_12)
   goals met: 3 of 4
7. (op_2 obj_14 obj_11 obj_09 obj_07)
   deleted: (pred_3 obj_14 obj_11 obj_07)
   added: (pred_1 obj_11 obj_09) (pred_4 obj_14 obj_07)
   goals met: 4 of 4
